app/controllers/blogs_controller.rb

  def index
 @user=User.find(params[:user_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1

  def new
    @user =User.find(params[:user_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 7 LIMIT 1

def create
    @user = User.find(params[:user_id])
  @blog = @user.blogs.new(blog_params)



  respond_to do |format|
    if @blog.save
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 7 LIMIT 1
INSERT INTO `blogs` (`title`, `description`, `comment`, `user_id`, `created_at`, `updated_at`) VALUES ('new blog', 'cfvdnj', 'fgvjmhbc', 7, '2023-01-09 09:34:30.774939', '2023-01-09 09:34:30.774939')

def update
  @user = User.find(params[:user_id])
  @blog=Blog.find(params[:id])

  respond_to do |format|
    if @blog.update(blog_params)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 7 LIMIT 1
SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 11 LIMIT 1
UPDATE `blogs` SET `blogs`.`description` = 'blog second 2245\n', `blogs`.`updated_at` = '2023-01-10 07:15:04.426598' WHERE `blogs`.`id` = 11

def destroy

  @user = User.find(params[:user_id])
  @blog=Blog.find(params[:id])

  @blog.destroy
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 21 LIMIT 1
DELETE FROM `blogs` WHERE `blogs`.`id` = 21

def show
   @user =User.find(params[:user_id])
   @blog=@user.blogs.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`user_id` = 4 AND `blogs`.`id` = 17 LIMIT 1

def edit
  @user =User.find(params[:user_id])
  @blog=@user.blogs.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 10 LIMIT 1
SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`user_id` = 10 AND `blogs`.`id` = 18 LIMIT 1