app/controllers/sessions_controller.rb

  def create
    user = User.find_by_email(params[:email])
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'manoj@gmail.com' LIMIT 1