app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `mobile`, `email`, `password_digest`, `address`, `created_at`, `updated_at`) VALUES ('rohit ', 8965471235, 'rohit@gmail.com', '$2a$12$ebu0UcuOmeT6IX4IH/U1nOnQkuTahUN77uflG9./vltrofJ8Qyi1K', 'dhamnod', '2023-01-10 05:16:15.648326', '2023-01-10 05:16:15.648326')

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE `users` SET `users`.`email` = 'rohit@gmail.com', `users`.`password_digest` = '$2a$12$Rx80BUwoTAFnFxieLfwWdOztBD1dlYpu00VBO/ME16qEm5t6U3Al2', `users`.`updated_at` = '2023-01-04 15:23:50.686338' WHERE `users`.`id` = 7